app/Services/AccessManagementService.php

SELECT *
FROM `companies`
ORDER BY `id`
SELECT *
FROM `outlets`
ORDER BY `id`
SELECT *
FROM `roles`
ORDER BY `id`
SELECT *
FROM `users`
ORDER BY `id`
SELECT *
FROM `user_roles`
SELECT *
FROM `user_outlets`
---
    public function data(): array
    {
        $db = Database::connect();
        $companies = (new CompanyModel())->orderBy('id')->findAll();
        $outlets = $db->tableExists('outlets') ? (new OutletModel())->orderBy('id')->findAll() : [];
        $roles = $db->tableExists('roles') ? (new RoleModel())->orderBy('id')->findAll() : [];
        $users = (new UserModel())->orderBy('id')->findAll();
        $userRoles = $db->tableExists('user_roles') ? $db->table('user_roles')->get()->getResultArray() : [];
        $userOutlets = $db->tableExists('user_outlets') ? $db->table('user_outlets')->get()->getResultArray() : [];

SELECT COUNT(*) AS `numrows`
FROM `users`
SELECT *
FROM `users`
ORDER BY `name` ASC
 LIMIT 100
SELECT *
FROM `user_roles`
WHERE `user_id` IN ('1')
SELECT *
FROM `user_outlets`
WHERE `user_id` IN ('1')
---
    public function userPage(int $companyId = 1, array $filters = []): array
    {
        $db = Database::connect();
        $page = max(1, (int) ($filters['page'] ?? 1));
        $perPage = min(100, max(1, (int) ($filters['per_page'] ?? $filters['perPage'] ?? 25)));
        $builder = $db->table('users');
        if ($this->hasCompanyColumn('users')) {
            $builder->where('company_id', $companyId);
        }

        if (($filters['status'] ?? '') !== '') {
            $builder->where('status', StatusCodeService::common((string) $filters['status']));
        }
        if (($filters['search'] ?? '') !== '') {
            $search = (string) $filters['search'];
            $builder->groupStart()
                ->like('name', $search)
                ->orLike('email', $search)
                ->groupEnd();
        }

        $countBuilder = clone $builder;
        $total = $countBuilder->countAllResults();
        $users = $builder
            ->orderBy('name', 'ASC')
            ->limit($perPage, ($page - 1) * $perPage)
            ->get()
            ->getResultArray();
        $roles = $this->rolesForCompany($companyId);
        $userIds = array_column($users, 'id') ?: [0];
        $userRoles = $db->table('user_roles')->whereIn('user_id', $userIds)->get()->getResultArray();
        $userOutlets = $db->table('user_outlets')->whereIn('user_id', $userIds)->get()->getResultArray();

SELECT *
FROM `roles`
---
    private function rolesForCompany(int $companyId): array
    {
        $model = new RoleModel();
        if ($this->hasCompanyColumn('roles')) {
            $model->where('company_id', $companyId);
        }
        return $model->findAll();