app/Services/OnboardingService.php

    public function status(int $companyId): array
    {
        $db = Database::connect();
        $builder = $db->table('companies');
        if ($db->fieldExists('id', 'companies')) {
            $builder->where('id', $companyId);
        }
        $company = $builder->get()->getRowArray() ?: $db->table('companies')->orderBy('id')->get()->getRowArray();
---
SELECT *
FROM `companies`
WHERE `id` = 1

    private function countSettings($db, int $companyId, array $keys): int
    {
        if (! $db->tableExists('app_settings')) return 0;
        $builder = $db->table('app_settings')
            ->whereIn('setting_key', $keys)
            ->where('deleted_at', null)
        ;
        if ($db->fieldExists('company_id', 'app_settings')) {
            $builder->where('company_id', $companyId);
        }
        return $builder->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `app_settings`
WHERE `setting_key` IN ('tax_rate','dine_in_service_rate','printer_name')
AND `deleted_at` IS NULL