app/Services/TenantDatabaseService.php

SELECT *
FROM `companies`
WHERE `id` = 1
AND `status` = 'active'
---
    public function companyFromClaims(array $claims): ?array
    {
        $companyId = $this->numericCompanyId((string) ($claims['companyId'] ?? ''));
        if ($companyId > 0) {
            $company = $this->centralConnection()
                ->table('companies')
                ->where('id', $companyId)
                ->where('status', 'active')
                ->get()
                ->getRowArray();