app/Filters/JwtAuthFilter.php

    private function claimsStillValid(array $claims): bool
    {
        $db = Database::connect();
        if (! $db->tableExists('users')) {
            return false;
        }

        $userId = (int) ($claims['sub'] ?? 0);
        $email = strtolower((string) ($claims['email'] ?? ''));
        if ($userId <= 0 || $email === '') {
            return false;
        }

        $user = $db->table('users')
            ->where('id', $userId)
            ->where('email', $email)
            ->whereIn('status', [\App\Services\StatusCodeService::ACTIVE, 'active'])
            ->get()
            ->getRowArray();
---
SELECT *
FROM `users`
WHERE `id` = 1
AND `email` = 'if.imam.faisal@gmail.com'
AND `status` = 'active'