app/Controllers/LegacyFrontendController.php

SELECT *
FROM `companies`
WHERE `route_slug` = 'IFresso-Coffee'
AND `status` = 'active'
 LIMIT 1
---
    public function tenantFile(string $slug, string $path)
    {
        $company = model(\App\Models\CompanyModel::class)->where('route_slug', $slug)->where('status', 'active')->first();