app/Models/ReportModel.php

SELECT *
FROM `outlets`
WHERE `id` = 1
---
    public function outlet(int $outletId): ?array
    {
        return Database::connect()
            ->table('outlets')
            ->where('id', $outletId)
            ->get()
            ->getRowArray() ?: null;

SELECT *
FROM `orders`
WHERE `outlet_id` = 1
AND `payment_status` != 'unpaid'
AND `created_at` >= '2026-06-29 00:00:00'
AND `created_at` <= '2026-07-05 23:59:59'
ORDER BY `created_at` DESC
---
    public function paidOrders(int $companyId, int $outletId, array $range): array
    {
        $db = Database::connect();
        $builder = $db
            ->table('orders')
            ->where('outlet_id', $outletId)
            ->whereNotIn('payment_status', [StatusCodeService::PAYMENT_UNPAID, 'unpaid', 'pending'])
            ->where('created_at >=', $range['startDateTime'])
            ->where('created_at <=', $range['endDateTime'])
            ->orderBy('created_at', 'DESC');
        if ($db->fieldExists('company_id', 'orders')) {
            $builder->where('company_id', $companyId);
        }
        return $builder->get()->getResultArray();

SELECT *
FROM `order_items`
WHERE `order_id` IN ('5')
---
    public function orderItems(array $orderIds): array
    {
        if (! $orderIds) return [];

        return Database::connect()
            ->table('order_items')
            ->whereIn('order_id', $orderIds)
            ->get()
            ->getResultArray();

SELECT `m`.*, `i`.`name` `ingredient_name`, `i`.`unit` `ingredient_unit`
FROM `stock_movements` `m`
LEFT JOIN `outlet_ingredients` `i` ON `i`.`id` = `m`.`outlet_ingredient_id`
WHERE `m`.`outlet_id` = 1
AND `m`.`created_at` >= '2026-06-29 00:00:00'
AND `m`.`created_at` <= '2026-07-05 23:59:59'
ORDER BY `m`.`created_at` DESC
---
    public function stockMovements(int $companyId, int $outletId, array $range): array
    {
        $db = Database::connect();
        $builder = $db
            ->table('stock_movements m')
            ->select('m.*, i.name ingredient_name, i.unit ingredient_unit')
            ->join('outlet_ingredients i', 'i.id = m.outlet_ingredient_id', 'left')
            ->where('m.outlet_id', $outletId)
            ->where('m.created_at >=', $range['startDateTime'])
            ->where('m.created_at <=', $range['endDateTime'])
            ->orderBy('m.created_at', 'DESC');
        if ($db->fieldExists('company_id', 'stock_movements')) {
            $builder->where('m.company_id', $companyId);
        }
        return $builder->get()->getResultArray();

SELECT `m`.*, `p`.`name` `product_name`, `p`.`sku` `product_sku`, `b`.`batch_no`
FROM `product_batch_movements` `m`
LEFT JOIN `products` `p` ON `p`.`id` = `m`.`product_id`
LEFT JOIN `product_batches` `b` ON `b`.`id` = `m`.`product_batch_id`
WHERE `m`.`outlet_id` = 1
AND `m`.`created_at` >= '2026-06-29 00:00:00'
AND `m`.`created_at` <= '2026-07-05 23:59:59'
ORDER BY `m`.`created_at` DESC
---
    public function productBatchMovements(int $companyId, int $outletId, array $range): array
    {
        $db = Database::connect();
        if (! $db->tableExists('product_batch_movements')) {
            return [];
        }

        $builder = $db
            ->table('product_batch_movements m')
            ->select('m.*, p.name product_name, p.sku product_sku, b.batch_no')
            ->join('products p', 'p.id = m.product_id', 'left')
            ->join('product_batches b', 'b.id = m.product_batch_id', 'left')
            ->where('m.outlet_id', $outletId)
            ->where('m.created_at >=', $range['startDateTime'])
            ->where('m.created_at <=', $range['endDateTime'])
            ->orderBy('m.created_at', 'DESC');
        if ($db->fieldExists('company_id', 'product_batch_movements')) {
            $builder->where('m.company_id', $companyId);
        }
        return $builder->get()->getResultArray();

SELECT *
FROM `operating_expenses`
WHERE `outlet_id` = 1
AND `expense_date` >= '2026-06-29'
AND `expense_date` <= '2026-07-05'
AND `status` != 'void'
ORDER BY `expense_date` DESC, `id` DESC
---
    public function operatingExpenses(int $companyId, int $outletId, array $range): array
    {
        $db = Database::connect();
        if (! $db->tableExists('operating_expenses')) {
            return [];
        }

        $builder = $db
            ->table('operating_expenses')
            ->where('outlet_id', $outletId)
            ->where('expense_date >=', $range['start'])
            ->where('expense_date <=', $range['end'])
            ->whereNotIn('status', [StatusCodeService::EXPENSE_VOID, 'void'])
            ->orderBy('expense_date', 'DESC')
            ->orderBy('id', 'DESC');
        if ($db->fieldExists('company_id', 'operating_expenses')) {
            $builder->where('company_id', $companyId);
        }
        return $builder->get()->getResultArray();