app/Models/SalesModel.php

    public function orders(int $companyId, int $outletId): array
    {
        $db = Database::connect();
        $builder = $db
            ->table('orders')
            ->where('outlet_id', $outletId)
            ->orderBy('created_at', 'ASC');
        if ($db->fieldExists('company_id', 'orders')) {
            $builder->where('company_id', $companyId);
        }
        return $builder->get()->getResultArray();
---
SELECT *
FROM `orders`
WHERE `outlet_id` = 1
ORDER BY `created_at` ASC